import React from 'react'
import SectionsHeader from '../common/SectionsHeader'
import { IntroBagIcon } from '../icons/icons'

const ProductIntroDescription = () => {
  return (
    <article className='article_introduction'>
    <SectionsHeader title="معرفی محصول" icon={<IntroBagIcon/>} link=""/>
        <div className="text_wrapper">
            <p>
            یک گوشی بسیار خوب میان رده روبه بالا با پردازنده قدرتمند اختصاصی خود سامسونگ _دوربین های قوی و باکیفیت_صفحه با وضوح و کیفیت بالای سوپر آمولود_ضد آب بودن _حافظه وم بالا_و در آخر کیفیت بالا و برند معتبر سامسونگ که واقعا بااین امکانات وقیمت در بین دیگر رقبای سامسونگ یک سر و گردن بالاتر هست و ارزش خرید بالایی داردیک گوشی بسیار خوب میان رده روبه بالا با پردازنده قدرتمند اختصاصی خود سامسونگ _دوربین های قوی و باکیفیت_صفحه با وضوح و کیفیت بالای سوپر آمولود_ضد آب بودن _حافظه وم بالا_و در آخر کیفیت بالا و برند معتبر سامسونگ که واقعا بااین امکانات وقیمت در بین دیگر رقبای سامسونگ یک سر و گردن بالاتر هست و ارزش خرید بالایی داردیک گوشی بسیار خوب میان رده روبه بالا با پردازنده قدرتمند اختصاصی خود سامسونگ _دوربین های قوی و باکیفیت_صفحه با وضوح و کیفیت بالای سوپر آمولود_ضد آب بودن _حافظه وم بالا_و در آخر کیفیت بالا و برند معتبر سامسونگ که واقعا بااین امکانات وقیمت در بین دیگر رقبای سامسونگ یک سر و گردن بالاتر هست و ارزش خرید بالایی دارد
            </p>
        </div>
      </article>
  )
}

export default ProductIntroDescription